app/Controllers/ContactController.php

    public function index()
    {
        $data['contacts'] = $this->contact->findAll();
---
SELECT *
FROM `contacts`

    public function create()
    {
        // Validation rules
        $validation = $this->validate([
            'name' => 'required',
            'email' => 'required|valid_email',
            'phone' => 'required',
            'address' => 'required'
        ]);

        if (!$validation) {
            // If validation fails, redirect back with input and errors
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // If validation passes, insert data into the database
        $this->contact->insert([
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'address' => $this->request->getPost('address'),
        ]);
---
INSERT INTO `contacts` (`name`, `email`, `phone`, `address`) VALUES ('Raisa Nuraida', 'raisanuraida11@gmail.com', '089604349692', 'ahaha')

    public function edit($id)
    {

        $this->contact->update($id, [
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'phone' => $this->request->getPost('phone'),
                'address' => $this->request->getPost('address'),
            ]);
---
UPDATE `contacts` SET `name` = 'Raisa Nuraida', `email` = 'raisanuraida11@gmail.com', `phone` = '089604349692', `address` = 'a'
WHERE `contacts`.`id` IN ('3')

    public function delete($id){
        $this->contact->delete($id);
---
DELETE FROM `contacts`
WHERE `id` IN ('3')